glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlocks.c
// ============================================================================
// samd21_interlocks.c — interlock framework foundation, slice 1.
// See samd21_interlocks.h for design summary.
// ============================================================================

#include "samd21_interlocks.h"
#include "samd21.h"
#include "samd21_hal_pin.h"
#include "samd21_pin_table.h"
#include "vendor/libcomm/opcodes.h"   // SHELL_STATUS_* values, OP_EVENT
#include "vendor/libcomm/frame.h"     // frame_encode_s2m for OP_EVENT push
#include <string.h>

// TX ring defined in main.c. We push OP_EVENT frames directly into it from
// interlock_tick_all when a slot state/tf transition is detected.
extern frame_ring_t g_tx_ring;
extern volatile uint16_t g_stack_hwm_bytes;   // defined in main.c

// Slice 6 — virtual input sources. board_millis() is the TinyUSB BSP wall clock
// (also used by the chain pump). g_last_m2s_rx_ms is set in rx_drain whenever a
// host frame finishes decoding; readers see at most ~1 tick of staleness.
extern uint32_t          board_millis(void);
extern volatile uint32_t g_last_m2s_rx_ms;

// ---------------------------------------------------------------------------
// Persistent state — lives in the .noinit linker section so RAM contents
// survive WDT / software / external resets. On POR + brown-out the section
// holds undefined garbage; interlock_boot_decide() recognises this via
// magic mismatch and re-initialises.
//
// Linker script seeeduino_xiao.ld MUST contain:
//   .noinit (NOLOAD) :
//   {
//       . = ALIGN(4);
//       KEEP(*(.noinit*))
//       . = ALIGN(4);
//   } > ram
//
// placed AFTER .bss so it isn't zeroed by the startup .bss loop, and AFTER
// .data so the .data init loop doesn't try to source from flash.
// ---------------------------------------------------------------------------

interlock_persist_t g_interlock_persist __attribute__((section(".noinit")));

// Tracks the currently-executing slot for HardFault attribution. Lives in
// .data (gets zeroed at startup is fine — fault attribution applies to the
// crash that NEXT happens, not a prior one). Initialise to "none" so a
// HardFault occurring outside any interlock tick is recorded that way.
volatile uint8_t g_active_interlock_slot = INTERLOCK_CRASHED_SLOT_NONE;

// ---------------------------------------------------------------------------
// Status buffer (slice 5). Rebuilt at the end of every interlock_tick_all()
// run. Lives in .data — does NOT need to survive WDT (host can re-poll the
// new snapshot post-boot).
//
// status_seq monotonically increments whenever any slot's state or tf flips.
// We track the previous tick's slot snapshot in a static below so the diff
// can be computed cheaply.
// ---------------------------------------------------------------------------

il_status_buffer_t g_il_status_buffer;

const il_status_buffer_t* interlock_get_status_buffer(void) {
    return &g_il_status_buffer;
}

// ---------------------------------------------------------------------------
// Slice 6 — runtime-only state. Kept out of .noinit because:
//   * Shift register on warm boot would hold stale samples; clearing is safer.
//   * Watch last-pass would falsely freeze hysteresis state across the bite.
// Both arrays zeroed on cold boot (.bss) and on every disarm / warm-restore.
// ---------------------------------------------------------------------------

static uint16_t g_input_shift_reg[INTERLOCK_MAX_SLOTS][IL_MAX_INPUTS];
static uint8_t  g_input_debounced[INTERLOCK_MAX_SLOTS][IL_MAX_INPUTS];
static uint8_t  g_watch_last_pass[INTERLOCK_MAX_SLOTS][IL_MAX_WATCHES];

static void clear_slot_runtime(uint8_t slot) {
    for (uint8_t i = 0; i < IL_MAX_INPUTS; i++) {
        g_input_shift_reg[slot][i] = 0;
        g_input_debounced[slot][i] = 0;
    }
    for (uint8_t i = 0; i < IL_MAX_WATCHES; i++) {
        g_watch_last_pass[slot][i] = 0;
    }
}

// ---------------------------------------------------------------------------
// Slice 6 — virtual input reader. Maps an IL_VIRT_* id to a u16 sample.
// Time-based virtuals saturate at u16 max so a 65 535 s ceiling (~18 h)
// can't roll over and look-like fresh data.
// ---------------------------------------------------------------------------

static uint16_t read_virtual_input(uint8_t virt_id) {
    uint32_t now_ms = board_millis();
    switch (virt_id) {
        case IL_VIRT_T_SINCE_M2S: {
            uint32_t dt_ms = now_ms - g_last_m2s_rx_ms;
            uint32_t dt_s  = dt_ms / 1000u;
            return (dt_s > 65535u) ? (uint16_t)65535u : (uint16_t)dt_s;
        }
        case IL_VIRT_UPTIME: {
            uint32_t up_s = now_ms / 1000u;
            return (up_s > 65535u) ? (uint16_t)65535u : (uint16_t)up_s;
        }
        case IL_VIRT_STACK_HWM:
            return g_stack_hwm_bytes;
        default:
            return 0;
    }
}

// ---------------------------------------------------------------------------
// Compile-time interlock registry. Slice-1 stub: the only entry is a no-op
// used to verify slot lifecycle + persistence across WDT bite. Slice 2 will
// add gpio_int / adc_int entries driven by parsed DSL.
// ---------------------------------------------------------------------------

// Noop role-model demonstration. Shows the contract every custom-C mode
// honors: init claims nothing, tick writes tf each pump, terminate cleans
// up nothing. Real modes add HAL claims in init, real input reads + tf
// decisions in tick, and resource teardown in terminate.
static void noop_init(uint8_t slot)      { (void)slot; }
static void noop_tick(uint8_t slot)      { interlock_set_slot_tf(slot, IL_TF_TRUE); }
static void noop_terminate(uint8_t slot) { (void)slot; }

const interlock_def_t g_interlocks[] = {
    // id = 1 (INTERLOCK_ID_NOOP)
    { "noop", noop_init, noop_tick, noop_terminate },
};

const uint8_t g_interlock_count = (uint8_t)(sizeof(g_interlocks) / sizeof(g_interlocks[0]));

// ---------------------------------------------------------------------------
// Boot decision
// ---------------------------------------------------------------------------

static bool persist_is_valid(void) {
    if (g_interlock_persist.magic != INTERLOCK_MAGIC) return false;
    if (g_interlock_persist.version != INTERLOCK_PERSIST_VERSION) return false;
    if (g_interlock_persist.self_size != (uint16_t)sizeof(interlock_persist_t)) return false;
    for (uint8_t i = 0; i < INTERLOCK_MAX_SLOTS; i++) {
        const interlock_slot_persist_t* s = &g_interlock_persist.slots[i];
        if (s->state > INTERLOCK_SLOT_POISONED) return false;
        // Valid IDs: 0 (none), 1 (compiled-in registry like noop), 2 (DSL).
        // Future slices may add more well-known IDs; check against the
        // hardcoded set rather than g_interlock_count (which only sizes
        // the compiled registry).
        if (s->id != INTERLOCK_ID_NONE
            && s->id != INTERLOCK_ID_NOOP
            && s->id != INTERLOCK_ID_DSL) return false;
        if (s->state == INTERLOCK_SLOT_ARMED && s->id == INTERLOCK_ID_NONE) return false;
        // DSL slot must have a non-empty persisted DSL text.
        if (s->state == INTERLOCK_SLOT_ARMED && s->id == INTERLOCK_ID_DSL) {
            uint16_t L = g_interlock_persist.dsl_len[i];
            if (L == 0u || L >= IL_DSL_MAX) return false;
        }
    }
    if (g_interlock_persist.crash.last_crashed_slot != INTERLOCK_CRASHED_SLOT_NONE
        && g_interlock_persist.crash.last_crashed_slot >= INTERLOCK_MAX_SLOTS) {
        return false;
    }
    return true;
}

// ---------------------------------------------------------------------------
// Amendment B — verify magic + version + self_size at every public-API entry.
//
// Already validated at boot by persist_is_valid(); this catches mid-run
// corruption (stack overflow, errant write, future bug) at the boundary
// where it would otherwise propagate into a torn read or worse.
//
// Static inline so the compiler can drop arg setup on each call site. Each
// site adds ~10 B text after dedup; 7 sites total → ~70 B.
// ---------------------------------------------------------------------------

static inline void verify_persist_or_panic(void) {
    if (g_interlock_persist.magic != INTERLOCK_MAGIC) {
        panic(PANIC_PERSIST_MAGIC_BAD, g_interlock_persist.magic);
    }
    if (g_interlock_persist.version != INTERLOCK_PERSIST_VERSION) {
        panic(PANIC_PERSIST_VERSION_BAD, g_interlock_persist.version);
    }
    if (g_interlock_persist.self_size != (uint16_t)sizeof(interlock_persist_t)) {
        panic(PANIC_PERSIST_SIZE_BAD, g_interlock_persist.self_size);
    }
}

static void persist_cold_init(void) {
    g_interlock_persist.magic     = INTERLOCK_MAGIC;
    g_interlock_persist.version   = INTERLOCK_PERSIST_VERSION;
    g_interlock_persist.reserved  = 0;
    g_interlock_persist.self_size = (uint16_t)sizeof(interlock_persist_t);
    for (uint8_t i = 0; i < INTERLOCK_MAX_SLOTS; i++) {
        g_interlock_persist.slots[i].state        = INTERLOCK_SLOT_EMPTY;
        g_interlock_persist.slots[i].id           = INTERLOCK_ID_NONE;
        g_interlock_persist.slots[i].boot_counter = 0;
        g_interlock_persist.slots[i].reserved     = 0;
        memset(&g_interlock_persist.inst[i], 0, sizeof(il_inst_t));
        g_interlock_persist.dsl_len[i] = 0;
        memset(g_interlock_persist.dsl_text[i], 0, IL_DSL_MAX);
    }
    g_interlock_persist.crash.last_pc            = 0;
    g_interlock_persist.crash.last_lr            = 0;
    g_interlock_persist.crash.last_rstsr         = 0;
    g_interlock_persist.crash.last_crashed_slot  = INTERLOCK_CRASHED_SLOT_NONE;
    g_interlock_persist.crash.panic_code         = PANIC_NONE;
    g_interlock_persist.crash.reserved[0]        = 0;
    g_interlock_persist.crash.reserved[1]        = 0;
    g_interlock_persist.crash.panic_arg          = 0;
    g_interlock_persist.crash.panic_sp           = 0;
}

void interlock_boot_decide(void) {
    if (!persist_is_valid()) {
        // Cold boot, corrupted noinit, or firmware version mismatch.
        persist_cold_init();
        return;
    }

    // Warm boot with valid state. Bump boot_counter for each ARMED slot;
    // if it exceeds MAX_BOOT_ATTEMPTS the slot is poisoned (the interlock
    // itself is likely the cause of the bootloop — don't re-arm it).
    for (uint8_t i = 0; i < INTERLOCK_MAX_SLOTS; i++) {
        interlock_slot_persist_t* s = &g_interlock_persist.slots[i];
        if (s->state == INTERLOCK_SLOT_ARMED) {
            if (s->boot_counter >= INTERLOCK_MAX_BOOT_ATTEMPTS) {
                s->state = INTERLOCK_SLOT_POISONED;
                // boot_counter left at limit so host can see how many tries.
            } else {
                s->boot_counter++;
            }
        }
    }
}

// ---------------------------------------------------------------------------
// Slot admin (slice 1: arm/disarm only the hardcoded no-op)
// ---------------------------------------------------------------------------

uint8_t interlock_armed_count(void) {
    uint8_t n = 0;
    for (uint8_t i = 0; i < INTERLOCK_MAX_SLOTS; i++) {
        if (g_interlock_persist.slots[i].state == INTERLOCK_SLOT_ARMED) n++;
    }
    return n;
}

// Summary flags for the RS-485 poll terminator (the "summary-bit"): bit0 set if
// any ARMED slot is currently in its ERR/veto state (tf == IL_TF_FALSE) — i.e.
// an interlock has tripped and there is something for the controller to fetch.
// Read from the per-tick status buffer so it reflects the latest evaluation.
uint8_t interlock_summary_flags(void) {
    const il_status_buffer_t* sb = interlock_get_status_buffer();
    uint8_t flags = 0;
    for (uint8_t i = 0; i < sb->num_slots && i < INTERLOCK_MAX_SLOTS; i++) {
        if (sb->slots[i].state == INTERLOCK_SLOT_ARMED && sb->slots[i].tf == IL_TF_FALSE) {
            flags |= 0x01u;   // bit0: an armed interlock is tripped
        }
    }
    return flags;
}

