glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlocks.c
// 7b piece 3 — the dumb-slave re-push one-shot. Set by CMD_INTERLOCK_REPUSH,
// consumed by the slave poll loop, which then re-emits buffer 2 on the next poll.
static volatile bool s_repush_req;
void interlock_request_repush(void) { s_repush_req = true; }
bool interlock_take_repush(void) {
    bool r = s_repush_req;
    s_repush_req = false;
    return r;
}

uint16_t interlock_build_status_v2(uint8_t* out) {
    uint16_t n = 0;
    out[n++] = 2;                          // reply version
    out[n++] = INTERLOCK_MAX_SLOTS;
    for (uint8_t i = 0; i < INTERLOCK_MAX_SLOTS; i++) {
        const interlock_slot_persist_t* s = interlock_get_slot(i);
        out[n++] = s->state;
        out[n++] = s->id;
        out[n++] = s->boot_counter;
        uint8_t tf = 0;
        const char* name = "";
        if (s->id == INTERLOCK_ID_DSL) {
            tf   = g_interlock_persist.inst[i].tf_state;
            name = g_interlock_persist.inst[i].name;
        } else if (s->id == INTERLOCK_ID_NOOP) {
            name = "noop";
        }
        out[n++] = tf;
        for (uint8_t k = 0; k < IL_NAME_MAX; k++) {   // fixed 16-byte NUL-padded name
            char ch = name[k];
            out[n++] = (uint8_t)ch;
            if (ch == '\0') {
                for (uint8_t j = (uint8_t)(k + 1); j < IL_NAME_MAX; j++) out[n++] = 0;
                break;
            }
        }
    }
    const interlock_crash_record_t* c = interlock_get_crash();
    out[n++] = (uint8_t)(c->last_pc);        out[n++] = (uint8_t)(c->last_pc >> 8);
    out[n++] = (uint8_t)(c->last_pc >> 16);  out[n++] = (uint8_t)(c->last_pc >> 24);
    out[n++] = (uint8_t)(c->last_lr);        out[n++] = (uint8_t)(c->last_lr >> 8);
    out[n++] = (uint8_t)(c->last_lr >> 16);  out[n++] = (uint8_t)(c->last_lr >> 24);
    out[n++] = (uint8_t)(c->last_rstsr);     out[n++] = (uint8_t)(c->last_rstsr >> 8);
    out[n++] = (uint8_t)(c->last_rstsr >> 16); out[n++] = (uint8_t)(c->last_rstsr >> 24);
    out[n++] = c->last_crashed_slot;
    return n;
}

uint8_t interlock_arm_slot_compiled(uint8_t slot, uint8_t id) {
    verify_persist_or_panic();
    if (slot >= INTERLOCK_MAX_SLOTS)            return SHELL_STATUS_BAD_ARGS;
    if (id == INTERLOCK_ID_NONE)                return SHELL_STATUS_BAD_ARGS;
    if (id == INTERLOCK_ID_DSL)                 return SHELL_STATUS_BAD_ARGS;
    if (id > g_interlock_count)                 return SHELL_STATUS_BAD_ARGS;
    interlock_slot_persist_t* s = &g_interlock_persist.slots[slot];
    if (s->state == INTERLOCK_SLOT_ARMED)       return SHELL_STATUS_BUSY;
    // POISONED slot is OK to overwrite — explicit re-arm clears the poison.
    s->state        = INTERLOCK_SLOT_ARMED;
    s->id           = id;
    s->boot_counter = 0;
    // Fresh-arm: zero inst[slot] so leftover bytes from a prior arm cycle
    // don't masquerade as state. Compiled modes only use tf_state.
    memset(&g_interlock_persist.inst[slot], 0, sizeof(il_inst_t));
    clear_slot_runtime(slot);
    // Call the mode's init now that persist is committed. If init crashes,
    // HardFault attribution shows this slot via g_active_interlock_slot.
    g_active_interlock_slot = slot;
    if (g_interlocks[id - 1].init) g_interlocks[id - 1].init(slot);
    g_active_interlock_slot = INTERLOCK_CRASHED_SLOT_NONE;
    return SHELL_STATUS_OK;
}

uint8_t interlock_arm_slot_noop(uint8_t slot) {
    return interlock_arm_slot_compiled(slot, INTERLOCK_ID_NOOP);
}

void interlock_set_slot_tf(uint8_t slot, il_tf_state_t tf) {
    if (slot >= INTERLOCK_MAX_SLOTS) return;
    g_interlock_persist.inst[slot].tf_state = (uint8_t)tf;
}

uint8_t interlock_disarm_slot(uint8_t slot) {
    verify_persist_or_panic();
    if (slot >= INTERLOCK_MAX_SLOTS) return SHELL_STATUS_BAD_ARGS;
    interlock_slot_persist_t* s = &g_interlock_persist.slots[slot];
    // For compiled (non-DSL) modes, call terminate while the slot is still
    // ARMED so the callback can read its own state. HAL pin claims are
    // released afterward — terminate may want to drop its own pin drivers
    // explicitly before then.
    if (s->state == INTERLOCK_SLOT_ARMED
        && s->id != INTERLOCK_ID_NONE
        && s->id != INTERLOCK_ID_DSL
        && s->id <= g_interlock_count
        && g_interlocks[s->id - 1].terminate) {
        g_active_interlock_slot = slot;
        g_interlocks[s->id - 1].terminate(slot);
        g_active_interlock_slot = INTERLOCK_CRASHED_SLOT_NONE;
    }
    // Release any HAL pin claims attached to this slot before clearing state.
    hal_pin_release_slot(slot);
    s->state        = INTERLOCK_SLOT_EMPTY;
    s->id           = INTERLOCK_ID_NONE;
    s->boot_counter = 0;
    memset(&g_interlock_persist.inst[slot], 0, sizeof(il_inst_t));
    g_interlock_persist.dsl_len[slot] = 0;
    clear_slot_runtime(slot);
    return SHELL_STATUS_OK;
}

// ---------------------------------------------------------------------------
// Slice 2 — DSL-driven slot admin + tick loop
// ---------------------------------------------------------------------------

static hal_pin_mode_t map_input_mode(uint8_t il_mode) {
    switch ((il_pin_mode_t)il_mode) {
        case IL_PIN_MODE_IN:    return HAL_PIN_MODE_GPIO_IN;
        case IL_PIN_MODE_IN_PU: return HAL_PIN_MODE_GPIO_IN_PU;
        case IL_PIN_MODE_IN_PD: return HAL_PIN_MODE_GPIO_IN_PD;
        case IL_PIN_MODE_ADC:   return HAL_PIN_MODE_ADC_SCAN;
        default:                return HAL_PIN_MODE_UNCLAIMED;
    }
}

// Claim every input + output pin declared by `inst`, owned by `slot`. On any
// failure releases all claims this call made and returns the HAL status of
// the failing claim. On success returns HAL_PIN_CLAIM_OK.
//
// Outputs go through hal_pin_claim_output() so shared-output sharing rules
// (matching ok/err values) apply across slots; inputs are still single-owner.
// ADC inputs go through hal_pin_claim_adc() with the per-input oversample/sh.
static hal_pin_claim_status_t claim_inst_pins(uint8_t slot, const il_inst_t* inst) {
    hal_pin_claim_status_t cs = HAL_PIN_CLAIM_OK;
    for (uint8_t i = 0; i < inst->input_count; i++) {
        il_pin_mode_t imode = (il_pin_mode_t)inst->inputs[i].mode;
        if (imode == IL_PIN_MODE_VIRTUAL) {
            // Virtual input: no physical pin to claim. Skip.
            continue;
        }
        if (imode == IL_PIN_MODE_ADC) {
            cs = hal_pin_claim_adc(inst->inputs[i].phys_id, slot,
                                   inst->inputs[i].oversample_exp,
                                   inst->inputs[i].sh_cyc);
        } else {
            hal_pin_mode_t mode = map_input_mode(inst->inputs[i].mode);
            if (mode == HAL_PIN_MODE_UNCLAIMED) { cs = HAL_PIN_CLAIM_BAD_MODE; goto rollback; }
            cs = hal_pin_claim(inst->inputs[i].phys_id, slot, mode);
        }
        if (cs != HAL_PIN_CLAIM_OK) goto rollback;
    }
    for (uint8_t i = 0; i < inst->output_count; i++) {
        cs = hal_pin_claim_output(inst->outputs[i].phys_id, slot,
                                  inst->outputs[i].ok_value,
                                  inst->outputs[i].err_value);
        if (cs != HAL_PIN_CLAIM_OK) goto rollback;
    }
    return HAL_PIN_CLAIM_OK;
rollback:
    hal_pin_release_slot(slot);
    return cs;
}

