glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlocks.c
uint8_t interlock_set_slot_dsl(uint8_t slot,
                               const char* text, uint16_t text_len,
                               uint8_t err_payload[3]) {
    verify_persist_or_panic();
    if (err_payload) { err_payload[0] = 0; err_payload[1] = 0; err_payload[2] = 0; }
    if (slot >= INTERLOCK_MAX_SLOTS)             return SHELL_STATUS_BAD_ARGS;
    if (text_len == 0u || text_len >= IL_DSL_MAX) return SHELL_STATUS_BAD_ARGS;

    interlock_slot_persist_t* sp = &g_interlock_persist.slots[slot];
    if (sp->state == INTERLOCK_SLOT_ARMED) return SHELL_STATUS_BUSY;

    il_inst_t parsed;
    uint16_t  err_off = 0;
    il_parse_status_t pst = il_parse(text, text_len, &parsed, &err_off);
    if (pst != IL_PARSE_OK) {
        if (err_payload) {
            err_payload[0] = (uint8_t)pst;
            err_payload[1] = (uint8_t)(err_off & 0xFFu);
            err_payload[2] = (uint8_t)((err_off >> 8) & 0xFFu);
        }
        return SHELL_STATUS_BAD_ARGS;
    }

    hal_pin_claim_status_t cs = claim_inst_pins(slot, &parsed);
    if (cs != HAL_PIN_CLAIM_OK) {
        if (err_payload) {
            err_payload[0] = 0xFFu;        // claim-conflict marker (not a parse error)
            err_payload[1] = (uint8_t)cs;  // sub-reason: hal_pin_claim_status_t
        }
        return SHELL_STATUS_BUSY;
    }

    // Commit to .noinit. The text is the source of truth; on warm boot we
    // re-parse from text rather than trusting the parsed struct directly.
    g_interlock_persist.inst[slot]    = parsed;
    g_interlock_persist.dsl_len[slot] = text_len;
    memcpy(g_interlock_persist.dsl_text[slot], text, text_len);
    if (text_len < IL_DSL_MAX) g_interlock_persist.dsl_text[slot][text_len] = '\0';

    sp->state        = INTERLOCK_SLOT_ARMED;
    sp->id           = INTERLOCK_ID_DSL;
    sp->boot_counter = 0;
    // Slice 6: fresh ARM starts with cleared debounce/hyst state — no false
    // edges from prior arm-cycle samples.
    clear_slot_runtime(slot);
    return SHELL_STATUS_OK;
}

// Re-parse + re-claim ARMED DSL slots after warm boot. Must run AFTER
// peripheral_init so reserved-pin enforcement is consistent. Slots that
// fail re-parse / re-claim are marked POISONED.
void interlock_warm_restore(void) {
    verify_persist_or_panic();
    for (uint8_t slot = 0; slot < INTERLOCK_MAX_SLOTS; slot++) {
        interlock_slot_persist_t* sp = &g_interlock_persist.slots[slot];
        if (sp->state != INTERLOCK_SLOT_ARMED) continue;
        // Compiled (non-DSL) modes: re-run init so the mode can re-claim
        // pins / re-arm peripherals after the WDT bite. Mode-private
        // .noinit state (if any) is the mode's responsibility to validate.
        if (sp->id != INTERLOCK_ID_DSL) {
            if (sp->id != INTERLOCK_ID_NONE
                && sp->id <= g_interlock_count
                && g_interlocks[sp->id - 1].init) {
                g_active_interlock_slot = slot;
                g_interlocks[sp->id - 1].init(slot);
                g_active_interlock_slot = INTERLOCK_CRASHED_SLOT_NONE;
            }
            clear_slot_runtime(slot);
            continue;
        }
        // DSL path — re-parse + re-claim from persisted text.
        uint16_t text_len = g_interlock_persist.dsl_len[slot];
        if (text_len == 0u || text_len >= IL_DSL_MAX) {
            sp->state = INTERLOCK_SLOT_POISONED;
            continue;
        }
        il_inst_t parsed;
        il_parse_status_t pst = il_parse(g_interlock_persist.dsl_text[slot],
                                         text_len, &parsed, 0);
        if (pst != IL_PARSE_OK) {
            sp->state = INTERLOCK_SLOT_POISONED;
            continue;
        }
        if (claim_inst_pins(slot, &parsed) != HAL_PIN_CLAIM_OK) {
            sp->state = INTERLOCK_SLOT_POISONED;
            continue;
        }
        g_interlock_persist.inst[slot] = parsed;
        // tf_state reset to UNEVALUATED — outputs will be re-asserted on
        // first tick after restore.
        g_interlock_persist.inst[slot].tf_state = (uint8_t)IL_TF_UNEVALUATED;
        // Slice 6: shift register + hyst memory don't survive the bite —
        // they're in .bss so already zero on cold boot, but explicit zero
        // here makes warm-restore identical to fresh arm (no stale samples).
        clear_slot_runtime(slot);
    }
}

// DNF aggregation (slice 7): tf = OR over groups of (AND of clauses in group).
// Single-group strings (no `|`) have all clauses in group 0 -> pure AND, so
// pre-slice-7 behaviour is preserved bit-for-bit. watch_count == 0 -> true.
bool il_dnf_result(const il_inst_t* inst, const bool* wpass) {
    if (inst->watch_count == 0u) return true;
    uint8_t max_group = 0u;
    for (uint8_t i = 0; i < inst->watch_count; i++)
        if (inst->watches[i].group > max_group) max_group = inst->watches[i].group;
    for (uint8_t g = 0; g <= max_group; g++) {
        bool grp_pass = true, grp_has = false;
        for (uint8_t i = 0; i < inst->watch_count; i++) {
            if (inst->watches[i].group != g) continue;
            grp_has = true;
            if (!wpass[i]) { grp_pass = false; break; }
        }
        if (grp_has && grp_pass) return true;   // one satisfied group -> TRUE
    }
    return false;
}

// Evaluate one slot's watches against a fresh input snapshot. Updates
// inst->tf_state in place. Does NOT touch outputs — that's the drive phase.
// Writes captured input values into out_input_vals[IL_MAX_INPUTS] so the
// status buffer can include them without re-reading hardware.
//
// Slice 6 extensions:
//   - GPIO inputs with debounce_depth >= 2 are filtered through a shift
//     register: the output flips only when N consecutive samples agree.
//   - ADC inputs with hyst != 0 get a directional dead-band on gt/lt/ge/le
//     watches: once a watch is in the pass state, the threshold is relaxed
//     by `hyst` so noise near the boundary doesn't cause flutter.
//   - Virtual inputs read synthesized signals (no hardware access).
static void eval_slot(uint8_t slot, il_inst_t* inst, uint16_t* out_input_vals) {
    g_active_interlock_slot = slot;

