glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlocks.c
    uint16_t input_vals[IL_MAX_INPUTS] = {0};
    for (uint8_t i = 0; i < inst->input_count; i++) {
        il_pin_mode_t imode = (il_pin_mode_t)inst->inputs[i].mode;
        uint16_t raw;
        if (imode == IL_PIN_MODE_ADC) {
            raw = hal_pin_read_adc(inst->inputs[i].phys_id);
        } else if (imode == IL_PIN_MODE_VIRTUAL) {
            raw = read_virtual_input(inst->inputs[i].phys_id);
        } else {
            raw = (uint16_t)(hal_pin_read(inst->inputs[i].phys_id) & 1u);
            uint8_t depth = inst->inputs[i].debounce_depth;
            if (depth >= 2u) {
                // Shift in new sample, mask to N bits, then flip the debounced
                // output only when all N bits agree (Schmitt-on-time).
                uint16_t mask = (uint16_t)((1u << depth) - 1u);
                uint16_t* sr = &g_input_shift_reg[slot][i];
                *sr = (uint16_t)(((*sr << 1) | (raw & 1u)) & mask);
                if      (*sr == mask) g_input_debounced[slot][i] = 1u;
                else if (*sr == 0u)   g_input_debounced[slot][i] = 0u;
                raw = g_input_debounced[slot][i];
            }
        }
        input_vals[i] = raw;
    }
    if (out_input_vals) {
        for (uint8_t i = 0; i < IL_MAX_INPUTS; i++) out_input_vals[i] = input_vals[i];
    }

    bool wpass[IL_MAX_WATCHES] = {0};
    for (uint8_t i = 0; i < inst->watch_count; i++) {
        uint8_t  idx  = inst->watches[i].input_idx;
        uint16_t v    = input_vals[idx];
        uint16_t t    = inst->watches[i].threshold;
        uint16_t hyst = inst->inputs[idx].hyst;
        uint16_t teff = t;
        // Hysteresis only adjusts directional comparisons. Parser already
        // rejected hyst+eq/ne (IL_PARSE_HYST_ON_EQ_NE) so we don't see them
        // here, but the switch defaults to plain compare for safety.
        if (hyst != 0u && g_watch_last_pass[slot][i]) {
            switch ((il_compare_op_t)inst->watches[i].op) {
                case IL_OP_GT:
                case IL_OP_GE:
                    teff = (t > hyst) ? (uint16_t)(t - hyst) : 0u;
                    break;
                case IL_OP_LT:
                case IL_OP_LE: {
                    uint32_t sum = (uint32_t)t + (uint32_t)hyst;
                    teff = (sum > 65535u) ? (uint16_t)65535u : (uint16_t)sum;
                    break;
                }
                default: break;
            }
        }
        bool pass = false;
        switch ((il_compare_op_t)inst->watches[i].op) {
            case IL_OP_EQ: pass = (v == t);    break;
            case IL_OP_NE: pass = (v != t);    break;
            case IL_OP_LT: pass = (v <  teff); break;
            case IL_OP_GT: pass = (v >  teff); break;
            case IL_OP_LE: pass = (v <= teff); break;
            case IL_OP_GE: pass = (v >= teff); break;
            default:       pass = false;       break;
        }
        g_watch_last_pass[slot][i] = pass ? 1u : 0u;
        wpass[i] = pass;
        // Don't early-out: we want every watch's last_pass updated each tick
        // so hysteresis is consistent across all watches in the slot.
    }
    inst->tf_state = il_dnf_result(inst, wpass) ? (uint8_t)IL_TF_TRUE
                                                : (uint8_t)IL_TF_FALSE;
}

// Per-chain-pump tick. Two phases:
//   1. Eval: every ARMED DSL slot reads inputs + evaluates watches → tf_state
//   2. Drive: build veto_mask (bit i = slot i is F) and hand to the HAL,
//      which writes every shared output exactly once with OR-of-vetoes
//      semantics.
//
// Splitting into phases is what makes multi-slot output sharing well-defined:
// without it the second slot would silently overwrite the first slot's vote
// every tick. With it, both slots contribute to a single combined value.
// Emit a 6 B OP_EVENT frame announcing a slot state or tf transition. Cheap;
// fire-and-forget into the TX ring. If the ring is full the frame is silently
// dropped — host can re-sync from the next OP_POLL.
static void emit_op_event(uint16_t seq, uint8_t slot,
                          uint8_t old_state, uint8_t new_state,
                          uint8_t old_tf,    uint8_t new_tf) {
    uint8_t payload[6];
    payload[0] = (uint8_t)(seq & 0xFFu);
    payload[1] = (uint8_t)((seq >> 8) & 0xFFu);
    payload[2] = slot;
    payload[3] = new_state;
    payload[4] = new_tf;
    // Pack the previous state+tf into one byte: high nibble=old_state, low=old_tf.
    payload[5] = (uint8_t)(((old_state & 0x0Fu) << 4) | (old_tf & 0x0Fu));
    frame_meta_t meta = {
        .addr        = 1,
        .cmd         = OP_EVENT,
        .seq         = (uint8_t)(seq & 0xFFu),
        .ack_seq     = 0,
        .ack_status  = 0,
        .payload_len = sizeof(payload),
    };
    (void)frame_encode_s2m(&meta, payload, &g_tx_ring);
}

void interlock_tick_all(void) {
    verify_persist_or_panic();
    // Phase 1 — evaluate. Dispatch by role mode:
    //   DSL slot  → eval_slot (parser-driven inputs + watches)
    //   Compiled  → g_interlocks[id-1].tick(slot); the mode writes its own
    //               tf via interlock_set_slot_tf and may read/drive HAL
    //               pins it claimed in init.
    for (uint8_t slot = 0; slot < INTERLOCK_MAX_SLOTS; slot++) {
        interlock_slot_persist_t* sp = &g_interlock_persist.slots[slot];
        if (sp->state != INTERLOCK_SLOT_ARMED) continue;
        if (sp->id == INTERLOCK_ID_DSL) {
            eval_slot(slot, &g_interlock_persist.inst[slot],
                      g_il_status_buffer.input_vals[slot]);
        } else if (sp->id != INTERLOCK_ID_NONE
                   && sp->id <= g_interlock_count) {
            g_active_interlock_slot = slot;
            if (g_interlocks[sp->id - 1].tick) g_interlocks[sp->id - 1].tick(slot);
        }
    }
    g_active_interlock_slot = INTERLOCK_CRASHED_SLOT_NONE;

    // Phase 2 — drive outputs. Build the veto mask from any ARMED slot
    // whose tf is FALSE, regardless of role mode. Compiled modes
    // participate by claiming outputs via hal_pin_claim_output in their
    // init and writing tf in their tick. Empty/POISONED slots have no
    // HAL claims so they don't affect output drive.
    uint8_t veto_mask = 0;
    for (uint8_t slot = 0; slot < INTERLOCK_MAX_SLOTS; slot++) {
        const interlock_slot_persist_t* sp = &g_interlock_persist.slots[slot];
        if (sp->state != INTERLOCK_SLOT_ARMED) continue;
        if (g_interlock_persist.inst[slot].tf_state == (uint8_t)IL_TF_FALSE) {
            veto_mask |= (uint8_t)(1u << slot);
        }
    }
    hal_pin_drive_outputs(veto_mask);

