glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlocks.c
    // Phase 3 — populate status buffer + emit OP_EVENT on slot transitions.
    // Compare new slot snapshots against the previous tick's status buffer
    // (slots[] are valid because Phase 3 is the only writer). status_seq
    // bumps only on a real state or tf transition.
    bool any_change = false;
    uint16_t new_seq = g_il_status_buffer.status_seq;
    for (uint8_t slot = 0; slot < INTERLOCK_MAX_SLOTS; slot++) {
        const interlock_slot_persist_t* sp = &g_interlock_persist.slots[slot];
        uint8_t new_state = sp->state;
        uint8_t new_id    = sp->id;
        // tf comes from inst[slot].tf_state regardless of role — DSL's
        // eval_slot writes it from watch evaluation, compiled modes
        // write it via interlock_set_slot_tf.
        uint8_t new_tf    = (sp->state == INTERLOCK_SLOT_ARMED)
                            ? g_interlock_persist.inst[slot].tf_state
                            : (uint8_t)IL_TF_UNEVALUATED;
        uint8_t old_state = g_il_status_buffer.slots[slot].state;
        uint8_t old_tf    = g_il_status_buffer.slots[slot].tf;
        if (old_state != new_state || old_tf != new_tf) {
            any_change = true;
            // Bump seq first so emitted event carries the new value.
            new_seq++;
            emit_op_event(new_seq, slot, old_state, new_state, old_tf, new_tf);
        }
        il_status_slot_t* s = &g_il_status_buffer.slots[slot];
        s->state     = new_state;
        s->id        = new_id;
        s->tf        = new_tf;
        s->bc        = sp->boot_counter;
        s->veto_mask = (veto_mask >> slot) & 1u;
        s->reserved  = 0;
        // Name source by role: DSL pulls from parsed inst.name (which may
        // not be null-terminated); compiled modes pull from the registry
        // entry's static name string (always null-terminated).
        if (new_state == INTERLOCK_SLOT_ARMED && new_id == INTERLOCK_ID_DSL) {
            for (uint8_t k = 0; k < IL_STATUS_SLOT_NAME_MAX; k++) {
                s->name[k] = g_interlock_persist.inst[slot].name[k];
            }
        } else if (new_state == INTERLOCK_SLOT_ARMED
                   && new_id != INTERLOCK_ID_NONE
                   && new_id <= g_interlock_count) {
            const char* src = g_interlocks[new_id - 1].name;
            for (uint8_t k = 0; k < IL_STATUS_SLOT_NAME_MAX; k++) {
                s->name[k] = src[k];
                if (src[k] == '\0') {
                    for (uint8_t j = k + 1; j < IL_STATUS_SLOT_NAME_MAX; j++) {
                        s->name[j] = '\0';
                    }
                    break;
                }
            }
        } else {
            memset(s->name, 0, IL_STATUS_SLOT_NAME_MAX);
        }
    }
    g_il_status_buffer.version          = IL_STATUS_BUFFER_VERSION;
    g_il_status_buffer.num_slots        = INTERLOCK_MAX_SLOTS;
    g_il_status_buffer.status_seq       = new_seq;
    g_il_status_buffer.crash_panic_code = g_interlock_persist.crash.panic_code;
    g_il_status_buffer.reserved0        = 0;
    g_il_status_buffer.stack_hwm_bytes  = g_stack_hwm_bytes;
    if (!any_change) {
        // No transition; status_seq unchanged — host poll loop can use it
        // as a freshness sentinel.
    }
}

const interlock_slot_persist_t* interlock_get_slot(uint8_t slot) {
    verify_persist_or_panic();
    if (slot >= INTERLOCK_MAX_SLOTS) return 0;
    return &g_interlock_persist.slots[slot];
}

const interlock_crash_record_t* interlock_get_crash(void) {
    verify_persist_or_panic();
    return &g_interlock_persist.crash;
}

// ---------------------------------------------------------------------------
// Boot-line formatter
// ---------------------------------------------------------------------------

static const char k_hex[] = "0123456789abcdef";

static uint16_t emit_str(char* dst, uint16_t pos, uint16_t cap, const char* s) {
    while (*s && pos + 1u < cap) dst[pos++] = *s++;
    return pos;
}

static uint16_t emit_hex32(char* dst, uint16_t pos, uint16_t cap, uint32_t v) {
    if (pos + 10u >= cap) return pos;
    dst[pos++] = '0';
    dst[pos++] = 'x';
    for (int i = 7; i >= 0; i--) {
        dst[pos++] = k_hex[(v >> (i * 4)) & 0xFu];
    }
    return pos;
}

static uint16_t emit_dec_small(char* dst, uint16_t pos, uint16_t cap, uint8_t v) {
    // 0..255
    char tmp[4];
    int n = 0;
    if (v == 0) tmp[n++] = '0';
    else while (v > 0 && n < 4) { tmp[n++] = (char)('0' + (v % 10)); v /= 10; }
    while (n-- > 0 && pos + 1u < cap) dst[pos++] = tmp[n];
    return pos;
}

static char slot_state_char(uint8_t state) {
    switch (state) {
        case INTERLOCK_SLOT_EMPTY:    return 'E';
        case INTERLOCK_SLOT_ARMED:    return 'A';
        case INTERLOCK_SLOT_POISONED: return 'P';
        default:                      return '?';
    }
}

uint16_t interlock_format_boot_line(char* buf, uint16_t bufsize) {
    if (bufsize == 0) return 0;
    uint16_t p = 0;
    p = emit_str(buf, p, bufsize, "[BOOT_IL]");
    for (uint8_t i = 0; i < INTERLOCK_MAX_SLOTS; i++) {
        const interlock_slot_persist_t* s = &g_interlock_persist.slots[i];
        p = emit_str(buf, p, bufsize, " sl");
        p = emit_dec_small(buf, p, bufsize, i);
        p = emit_str(buf, p, bufsize, "=");
        if (p + 1u < bufsize) buf[p++] = slot_state_char(s->state);
        p = emit_str(buf, p, bufsize, ":");
        p = emit_dec_small(buf, p, bufsize, s->id);
        p = emit_str(buf, p, bufsize, ":");
        p = emit_dec_small(buf, p, bufsize, s->boot_counter);
    }
    p = emit_str(buf, p, bufsize, " pc=");
    p = emit_hex32(buf, p, bufsize, g_interlock_persist.crash.last_pc);
    p = emit_str(buf, p, bufsize, " lr=");
    p = emit_hex32(buf, p, bufsize, g_interlock_persist.crash.last_lr);
    p = emit_str(buf, p, bufsize, " rs=");
    p = emit_hex32(buf, p, bufsize, g_interlock_persist.crash.last_rstsr);
    p = emit_str(buf, p, bufsize, " cs=");
    if (g_interlock_persist.crash.last_crashed_slot == INTERLOCK_CRASHED_SLOT_NONE) {
        if (p + 1u < bufsize) buf[p++] = '-';
    } else {
        p = emit_dec_small(buf, p, bufsize, g_interlock_persist.crash.last_crashed_slot);
    }
    // Panic record (only when this boot follows a software-detected panic).
    // Format: " pn=N pa=0xNNNN psp=0xNNNN". Skipped when panic_code == 0.
    if (g_interlock_persist.crash.panic_code != PANIC_NONE) {
        p = emit_str(buf, p, bufsize, " pn=");
        p = emit_dec_small(buf, p, bufsize, g_interlock_persist.crash.panic_code);
        p = emit_str(buf, p, bufsize, " pa=");
        p = emit_hex32(buf, p, bufsize, g_interlock_persist.crash.panic_arg);
        p = emit_str(buf, p, bufsize, " psp=");
        p = emit_hex32(buf, p, bufsize, g_interlock_persist.crash.panic_sp);
    }
    if (p < bufsize) buf[p] = '\0';
    return p;
}

// ---------------------------------------------------------------------------
// HardFault handling
//
// CMSIS provides a weak HardFault_Handler that infinite-loops. We override
// it with a naked thunk that grabs MSP and calls the C recorder. The
// recorder writes crash context into .noinit then triggers system reset
// (which loops back through main, where interlock_boot_decide() sees the
// bumped boot_counter and the new crash record).
//
// Cortex-M0+ exception stack frame (basic, no FP):
//   sp[0]..sp[3] = R0..R3
//   sp[4]        = R12
//   sp[5]        = LR  (caller's return address at exception entry)
//   sp[6]        = ReturnAddress (PC of the faulting/next instruction)
//   sp[7]        = xPSR
// ---------------------------------------------------------------------------

void interlock_hardfault_record(uint32_t* msp) {
    g_interlock_persist.crash.last_pc            = msp[6];
    g_interlock_persist.crash.last_lr            = msp[5];
    g_interlock_persist.crash.last_rstsr         = (uint32_t)PM->RCAUSE.reg;
    g_interlock_persist.crash.last_crashed_slot  = g_active_interlock_slot;
    g_interlock_persist.crash.panic_code         = PANIC_NONE;  // hardware path
    // NVIC_SystemReset() is inline; the asm DSB+DMB inside ensures the
    // .noinit writes commit before the reset takes effect.
    NVIC_SystemReset();
    for (;;) { /* unreachable */ }
}

// ---------------------------------------------------------------------------
// panic() — software-detected invariant violations
//
// Distinct from HardFault: panic() runs in normal context, so SP/LR live in
// the current frame rather than an exception stack frame. We grab SP via
// inline asm and use __builtin_return_address(0) for the caller PC. Records
// commit to .noinit, then immediate NVIC_SystemReset (per slice-5 Q5
// ratification — get out fast, crash record carries the post-mortem).
// ---------------------------------------------------------------------------

__attribute__((noreturn))
void panic(panic_code_t code, uint32_t arg) {
    uint32_t sp;
    __asm__ volatile ("mov %0, sp" : "=r"(sp));
    uint32_t caller_pc = (uint32_t)__builtin_return_address(0);

    g_interlock_persist.crash.last_pc            = caller_pc;
    g_interlock_persist.crash.last_lr            = 0;          // n/a for panic
    g_interlock_persist.crash.last_rstsr         = (uint32_t)PM->RCAUSE.reg;
    g_interlock_persist.crash.last_crashed_slot  = g_active_interlock_slot;
    g_interlock_persist.crash.panic_arg          = arg;
    g_interlock_persist.crash.panic_sp           = sp;
    g_interlock_persist.crash.panic_code         = (uint8_t)code;

    NVIC_SystemReset();
    for (;;) { /* unreachable */ }
}

__attribute__((naked, noreturn)) void HardFault_Handler(void) {
    __asm__ volatile (
        "mrs  r0, msp                   \n"
        "ldr  r1, =interlock_hardfault_record  \n"
        "bx   r1                        \n"
    );
}
